app/views/articles/index.html.erb

SELECT  "articles".* FROM "articles" ORDER BY viewcount DESC LIMIT $1  [["LIMIT", 5]]
---
                      <h2 class="small-header">Post</h2>
                      <% @posts = Article.order('viewcount DESC').limit(5) %>