app/views/articles/show.html.erb

                     <% @article.viewcount = @article.viewcount + 1
                        @article.save %>
---
UPDATE "articles" SET "viewcount" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["viewcount", 2], ["updated_at", "2020-05-30 16:07:31.636844"], ["id", 7]]

                  <br>
                  <% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]

               <h2 class="small-header">Post</h2>
               <% @posts = Article.order('viewcount DESC').limit(5) %>
---
SELECT  "articles".* FROM "articles" ORDER BY viewcount DESC LIMIT $1  [["LIMIT", 5]]