app/views/users/edit.html.erb

                <li>
                <% @user.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]

                <li>
                <% @user.comments.each do |comment| %>
                    <strong><%= comment.created_at.to_formatted_s(:long) %> </strong> in
                    <%=
                    a= Article.find_by_id(comment.article_id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

                <strong><%= comment.created_at.to_formatted_s(:long) %> </strong> in
                <%=
                a= Article.find_by_id(comment.article_id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        <% @user.articles.each do |article| %>
            <% article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 2]]