app/views/users/show.html.erb

            <li>
               <% @user.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 34]]

            <li>
               <% @user.comments.each do |comment| %>
               <strong><%= comment.created_at.to_formatted_s(:long) %> </strong> in
               <%=
                  a= Article.find_by_id(comment.article_id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]