app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (title LIKE '%A Seed Article%' OR text LIKE '%A Seed Article%' or topic LIKE '%A Seed Article%') ORDER BY created_at DESC
SELECT "users".* FROM "users"
SELECT DISTINCT "articles"."topic" FROM "articles"
---
  def index
      @articles = Article.all
      if params[:search]
        @articles = Article.search(params[:search]).order("created_at DESC")
      else
        @articles = Article.all.order("created_at DESC")
      end
      @users = User.all
      @topics = Article.distinct.pluck(:topic)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT DISTINCT "articles"."topic" FROM "articles"
---
  def show
      @article = Article.find(params[:id])
      @users = User.all
      @topics = Article.distinct.pluck(:topic)

INSERT INTO "articles" ("title", "text", "topic", "user", "created_at", "updated_at", "user_id", "viewcount", "commentcount") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
      @article = Article.new(article_params)
      @article.user_id = current_user.id
      @article.user = current_user.username
      @article.viewcount = 0
      @article.commentcount = 0

      if @article.save