app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commenter", "Geoffrey"], ["body", "Amazing article Bob!"], ["article_id", 3], ["created_at", "2020-05-30 11:57:41.038037"], ["updated_at", "2020-05-30 11:57:41.038037"], ["user_id", 2]]
UPDATE "articles" SET "commentcount" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["commentcount", 1], ["updated_at", "2020-05-30 11:57:41.043619"], ["id", 3]]
---
    def create
        @article = Article.find(params[:article_id])
        puts(comment_params)
        puts(current_user)
        @comment = Comment.new(comment_params)
        @comment.user_id = current_user.id
        @comment.article_id = params[:article_id]
        @comment.commenter = current_user.username
        @comment.save
        @article.commentcount = @article.commentcount + 1
        @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "commentcount" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["commentcount", 0], ["updated_at", "2020-05-31 09:49:51.700359"], ["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
      def destroy
        puts(params[:article_id])
        puts(params[:id])
        @article = Article.find(params[:article_id])
        @article.commentcount = @article.commentcount - 1
        @article.save
        @comment = Comment.find(params[:id])
        @comment.delete