app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "username", "mobile", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = $1, "student_name" = $2, "student_number" = $3 WHERE "users"."id" = $4  [["updated_at", "2020-05-30 11:27:25.086691"], ["student_name", "Gladys Ganda"], ["student_number", "S3679389"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)