app/views/layouts/_header.html.erb

SELECT  "articles".* FROM "articles" ORDER BY viewcount DESC LIMIT $1  [["LIMIT", 2]]
---
            <div class="news-dropdown-content">
              <% @posts = Article.order('viewcount DESC').limit(2) %>